app/controllers/line_items_controller.rb

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    session[:counter] = 0

    respond_to do |format|
      if @line_item.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-12-11 07:11:07.324983"], ["updated_at", "2015-12-11 07:11:07.324983"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 2], ["cart_id", 1], ["created_at", "2015-12-11 07:11:07.914715"], ["updated_at", "2015-12-11 07:11:07.914715"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2015-12-11 12:29:12.293607"], ["id", 1]]